use crate::parsing::PoemDatabase;

const MAJOR_AUTHORS: &[&str] = &[
    "Сергей Есенин",
    "Александр Блок",
    "Михаил Лермонтов",
    "Александр Пушкин",
    "Николай Некрасов",
    "Марина Цветаева",
];

const MEDIUM_AUTHORS: &[&str] = &[
    "Федор Тютчев",
    "Афанасий Фет",
    "Анна Ахматова",
    "Владимир Маяковский",
    "Аполлон Майков",
    "Иван Никитин",
    "Константин Бальмонт",
    "Осип Мандельштам",
    "Иван Крылов",
    "Василий Жуковский",
];

const MINOR_AUTHORS: &[&str] = &[
    "Николай Гоголь",
    "Валерий Брюсов",
    "Алексей Толстой",
    "Данте Алигьери",
    "Кондратий Рылеев",
    "Мольер",
    "Алексей Кольцов",
    "Петр Ершов",
    "Уильям Шекспир",
    "Александр Островский",
    "Всеволод Гаршин",
    "Иван Тургенев",
    "Аркадий Гайдар",
    "Мигель де Сервантес Сааведра",
    "Михаил Ломоносов",
    "Гомер",
    "Николай Гумилев",
    "Евгений Баратынский",
    "Александр Грибоедов",
    "Гавриил Державин",
];

pub struct Problem {
    poem: String,
    authors: Vec<&'static str>,
}

fn random_author() -> &'static str {
    let r = rand::random_range(0..100);
    let group = match r {
        0..40 => MAJOR_AUTHORS,
        40..80 => MEDIUM_AUTHORS,
        _ => MINOR_AUTHORS,
    };
    return group[rand::random_range(0..group.len())];
}

fn random_poem(db: &PoemDatabase, author: String) {}
